var _addCart = 1;

// 加入购物车事件
function addToCart() {
  if (_addCart <= 0) {
    return false;
  }
  fbq("track", "AddToCart");
  _addCart--;
}

const arr = [
  " 由紀** - 先程先生のグループチャットに参加しました​ ",
  "  清子 ** - 先程先生のグループチャットに参加しました​ ",
  " 将太 ** - 先程先生のグループチャットに参加しました​ ",
  " はるか ** - 先程先生のグループチャットに参加しました​ ",
  "春樹  ** - 先程先生のグループチャットに参加しました​ ",
  " 智子 ** - 先程先生のグループチャットに参加しました​ ",
  " 暁斗 ** - 先程先生のグループチャットに参加しました​ ",
  " 信夫 ** - 先程先生のグループチャットに参加しました​ ",
  " 志津子 ** - 先程先生のグループチャットに参加しました​ ",
  " 光太郎 ** - 先程先生のグループチャットに参加しました​ ",
  " あゆみ ** - 先程先生のグループチャットに参加しました​ ",
  " 陽子 ** - 先程先生のグループチャットに参加しました​ ",
  " 優太 ** - 先程先生のグループチャットに参加しました​ ",
  " 唯 ** - 先程先生のグループチャットに参加しました​ ",
  " 良太 ** - 先程先生のグループチャットに参加しました​ ",
  " 結衣 ** - 先程先生のグループチャットに参加しました​ ",
  " 翔太 ** - 先程先生のグループチャットに参加しました​ ",
  " 美樹  ** - 先程先生のグループチャットに参加しました​ ",
  " 謙太郎 ** - 先程先生のグループチャットに参加しました​ ",
  " 繭子 ** - 先程先生のグループチャットに参加しました​ ",
  " 健太 ** - 先程先生のグループチャットに参加しました​ ",
  "  恵子** - 先程先生のグループチャットに参加しました​ ",
  " 直樹 ** - 先程先生のグループチャットに参加しました​ ",
  " 美咲 ** - 先程先生のグループチャットに参加しました​ ",
  " 哲也 ** - 先程先生のグループチャットに参加しました​ ",
  " 博子 ** - 先程先生のグループチャットに参加しました​ ",
  " 亮太 ** - 先程先生のグループチャットに参加しました​ ",
  " 安室 ** - 先程先生のグループチャットに参加しました​ ",
  " 幸子  ** - 先程先生のグループチャットに参加しました​ ",
  " 高志 ** - 先程先生のグループチャットに参加しました​ ",
  " 純子  ** - 先程先生のグループチャットに参加しました​ ",
  " 聡美 ** - 先程先生のグループチャットに参加しました​ ",
  " 俊太郎 ** - 先程先生のグループチャットに参加しました​ ",
  " 正夫 ** - 先程先生のグループチャットに参加しました​ ",
  " 麻美  ** - 先程先生のグループチャットに参加しました​ ",
  " 千春 ** - 先程先生のグループチャットに参加しました​ ",
  " 勇太 ** - 先程先生のグループチャットに参加しました​ ",
  " 真一 ** - 先程先生のグループチャットに参加しました​ ",
  " 正夫 ** - 先程先生のグループチャットに参加しました​ ",
  "  佐藤** - 先程先生のグループチャットに参加しました​ ",
  " 高橋 ** - 先程先生のグループチャットに参加しました​ ",
  " 渡辺 ** - 先程先生のグループチャットに参加しました​ ",
  " 田中 ** - 先程先生のグループチャットに参加しました​ ",
  " 伊藤 ** - 先程先生のグループチャットに参加しました​ ",
  "中村  ** - 先程先生のグループチャットに参加しました​ ",
  " 佐木 ** - 先程先生のグループチャットに参加しました​ ",
  " .山田 ** - 先程先生のグループチャットに参加しました​ ",
  " .吉田 ** - 先程先生のグループチャットに参加しました​ ",
  " 加藤 ** - 先程先生のグループチャットに参加しました​ ",
  " 志津子 ** - 先程先生のグループチャットに参加しました​ ",
  " 春樹 ** - 先程先生のグループチャットに参加しました​ ",
  " 繭子 ** - 先程先生のグループチャットに参加しました​ ",
  "博子  ** - 先程先生のグループチャットに参加しました​ ",
  " 幸子 ** - 先程先生のグループチャットに参加しました​ ",
  " 聡美 ** - 先程先生のグループチャットに参加しました​ ",
  " 正夫 ** - 先程先生のグループチャットに参加しました​ ",
  "結衣  ** - 先程先生のグループチャットに参加しました​ ",
  " はるか ** - 先程先生のグループチャットに参加しました​ ",
  "春樹  ** - 先程先生のグループチャットに参加しました​ ",
  " 智子 ** - 先程先生のグループチャットに参加しました​ ",
  " 暁斗 ** - 先程先生のグループチャットに参加しました​ ",
  " 信夫 ** - 先程先生のグループチャットに参加しました​ ",
  " 志津子 ** - 先程先生のグループチャットに参加しました​ ",
  " 光太郎 ** - 先程先生のグループチャットに参加しました​ ",
  " あゆみ ** - 先程先生のグループチャットに参加しました​ ",
  " 陽子 ** - 先程先生のグループチャットに参加しました​ ",
  " 優太 ** - 先程先生のグループチャットに参加しました​ ",
  " 唯 ** - 先程先生のグループチャットに参加しました​ ",
  " 良太 ** - 先程先生のグループチャットに参加しました​ ",
  " 結衣 ** - 先程先生のグループチャットに参加しました​ ",
  " 翔太 ** - 先程先生のグループチャットに参加しました​ ",
  " 美樹  ** - 先程先生のグループチャットに参加しました​ ",
  " 謙太郎 ** - 先程先生のグループチャットに参加しました​ ",
  " 繭子 ** - 先程先生のグループチャットに参加しました​ ",
  " 健太 ** - 先程先生のグループチャットに参加しました​ ",
  "  恵子** - 先程先生のグループチャットに参加しました​ ",
  " 直樹 ** - 先程先生のグループチャットに参加しました​ ",
  " 美咲 ** - 先程先生のグループチャットに参加しました​ ",
  " 哲也 ** - 先程先生のグループチャットに参加しました​ ",
  " 博子 ** - 先程先生のグループチャットに参加しました​ ",
  " 亮太 ** - 先程先生のグループチャットに参加しました​ ",
  " 安室 ** - 先程先生のグループチャットに参加しました​ ",
  " 幸子  ** - 先程先生のグループチャットに参加しました​ ",
  " 高志 ** - 先程先生のグループチャットに参加しました​ ",
  " 純子  ** - 先程先生のグループチャットに参加しました​ ",
  " 聡美 ** - 先程先生のグループチャットに参加しました​ ",
];

const main = document.querySelector(".kinsho");
let tips__text = document.querySelector(".tips__text");
let index = 0;

function removeTips() {
  tips__text = document.querySelector(".tips__text");
  tips__text.parentElement?.removeChild(tips__text);
}

function createTips() {
  const tips__text = document.createElement("div");
  tips__text.className = "tips__text";
  tips__text.innerHTML = arr[index];
  tips__text.onclick = showline;
  main.appendChild(tips__text);
}

setInterval(() => {
  index++;
  if (index >= arr.length) {
    index = 0;
  }
  removeTips();
  createTips();
}, 3000);

// function showline() {
//   addToCart();
//   location.href = "https://lihi3.cc/ORCzM";
// }
//      setTimeout(()=>{
//             showline()
//         },16000)
